#==============第一种导入方式=======================
#import 包.模块
#import package01.module01
#使用：包.模块.成员
#package01.module01.fun01()
#---------------运行结果---------------------------
#module01--fun01

#==============第二种导入方式=======================
#from 包 import 模块
#from package01 import module01
#使用：模块.成员
#module01.fun01()
#---------------运行结果---------------------------
#module01--fun01

#==============第三种导入方式=======================
#from 包 import *
#from package01 import *
#*中为__init__文件加入__all_模块变量
#使用：模块.成员
#module01.fun01()
#---------------运行结果---------------------------
#module01--fun01

#==============建议第四种导入方式=====================
#from 包.模块 import *
#from package01.module01 import *
#*中为__init__文件加入__all_模块变量
#使用：成员
#fun01()
#---------------运行结果---------------------------
#module01--fun01

#————————————————————————————————————————————————
from package01.package02.module02 import *
fun02()